In [2]:
import pandas as pd

In [3]:
employee = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6, 7],
    'name': ['Joe', 'Henry', 'Sam', 'Max', 'Janet', 'Randy', 'Will'],
    'salary': [85000, 80000, 60000, 90000, 69000, 85000, 70000],
    'departmentId': [1, 2, 2, 1, 1, 1, 1]
})

In [4]:
employee

   id   name  salary  departmentId
0   1    Joe   85000             1
1   2  Henry   80000             2
2   3    Sam   60000             2
3   4    Max   90000             1
4   5  Janet   69000             1
5   6  Randy   85000             1
6   7   Will   70000             1

In [5]:
department = pd.DataFrame({
    'id': [1, 2],
    'name': ['IT', 'Sales']
})

In [6]:
department

   id   name
0   1     IT
1   2  Sales

In [9]:
df = employee.merge(department, how= 'inner', left_on= 'departmentId', right_on= 'id', suffixes= ('_e', '_d'))

In [10]:
df

   id_e name_e  salary  departmentId  id_d name_d
0     1    Joe   85000             1     1     IT
1     2  Henry   80000             2     2  Sales
2     3    Sam   60000             2     2  Sales
3     4    Max   90000             1     1     IT
4     5  Janet   69000             1     1     IT
5     6  Randy   85000             1     1     IT
6     7   Will   70000             1     1     IT

In [13]:
df['d_rnk'] = df.groupby(by= 'departmentId')['salary'].rank(method= 'dense', ascending= False)

In [14]:
df

   id_e name_e  salary  departmentId  id_d name_d  d_rnk
0     1    Joe   85000             1     1     IT    2.0
1     2  Henry   80000             2     2  Sales    1.0
2     3    Sam   60000             2     2  Sales    2.0
3     4    Max   90000             1     1     IT    1.0
4     5  Janet   69000             1     1     IT    4.0
5     6  Randy   85000             1     1     IT    2.0
6     7   Will   70000             1     1     IT    3.0

In [17]:
df[df['d_rnk'] <= 3][['name_d', 'name_e', 'salary']].rename(columns= {'name_d': 'Department', 'name_e': 'Employement', 'salary': 'Salary'})

  Department Employement  Salary
0         IT         Joe   85000
1      Sales       Henry   80000
2      Sales         Sam   60000
3         IT         Max   90000
5         IT       Randy   85000
6         IT        Will   70000